Revit 2027 API
StructuralConnectionHandler.GetInputPoint Method
 Returns point with specified id. Returns null if specified point does not exist
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectionInputPoint GetInputPoint(
	Guid id
)
Public Function GetInputPoint (
	id As Guid
) As ConnectionInputPoint
public:
ConnectionInputPoint^ GetInputPoint(
	Guid id
)
member GetInputPoint :
        id : Guid -> ConnectionInputPoint
Parameters
id Guid
Return Value
ConnectionInputPoint
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace